Creation in two steps works as expected:

## First step: create the bucket, no lifecycle nor locking rules

```hcl
terraform {
  cloud {
    organization = "XXXXXXXX"
    workspaces {
      name = "scaleway-debug"
    }
  }
  required_providers {
    scaleway = {
      source = "scaleway/scaleway"
      version = "~>2.8"
    }
  }
}

locals {
  organization_id = "XXXXXXXX"
  environment = "debug-20220102"
}

provider "scaleway" {
  region = "fr-par"
  profile = "XXXXXXXX"
  organization_id = local.organization_id
}

resource "scaleway_object_bucket" "backup" {
  name = "XXXXXXXX-${local.environment}-backup-appdata"
  region = "fr-par"

  object_lock_enabled = true
}
```

Plan output:

```tf
Terraform will perform the following actions:

  # scaleway_object_bucket.backup will be created
  + resource "scaleway_object_bucket" "backup" {
      + acl                 = "private"
      + endpoint            = (known after apply)
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "XXXXXXXX-debug-20220102-backup-appdata"
      + object_lock_enabled = true
      + region              = "fr-par"
      + tags                = {
          + "Component"   = "backup"
          + "Environment" = "debug-20220102"
          + "Role"        = "storage"
        }

      + versioning {
          + enabled = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Output:

```tf
scaleway_object_bucket.backup: Creating...
scaleway_object_bucket.backup: Still creating... [10s elapsed]
scaleway_object_bucket.backup: Creation complete after 16s [id=fr-par/XXXXXXXX-debug-20220102-backup-appdata]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

## Second step: Add bucket locking and lifecycle rules

```hcl
resource "scaleway_object_bucket" "backup" {
  name = "XXXXXXXX-${local.environment}-backup-appdata"
  region = "fr-par"

  object_lock_enabled = true

  lifecycle_rule {
    id = "expire-old-backups"
    enabled = true
    expiration {
      days = 30
    }
  }

  lifecycle_rule {
    id = "expire-partial-uploads"
    enabled = true
    abort_incomplete_multipart_upload_days = 1
  }

  versioning {
    enabled = true
  }

  tags = {
    Environment = "${local.environment}"
    Component = "backup"
    Role = "storage"
  }
}

resource "scaleway_object_bucket_lock_configuration" "backup" {
  bucket = scaleway_object_bucket.backup.name
  rule {
    default_retention {
      mode = "GOVERNANCE"
      days = 30
    }
  }
}
```

Plan:

```tf
Terraform will perform the following actions:

  # scaleway_object_bucket.backup will be updated in-place
  ~ resource "scaleway_object_bucket" "backup" {
        id                  = "fr-par/XXXXXXXX-debug-20220102-backup-appdata"
        name                = "XXXXXXXX-debug-20220102-backup-appdata"
        tags                = {
            "Component"   = "backup"
            "Environment" = "debug-20220102"
            "Role"        = "storage"
        }
        # (5 unchanged attributes hidden)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire-old-backups"

          + expiration {
              + days = 30
            }
        }
      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 1
          + enabled                                = true
          + id                                     = "expire-partial-uploads"
        }

        # (1 unchanged block hidden)
    }

  # scaleway_object_bucket_lock_configuration.backup will be created
  + resource "scaleway_object_bucket_lock_configuration" "backup" {
      + bucket = "XXXXXXXX-debug-20220102-backup-appdata"
      + id     = (known after apply)

      + rule {
          + default_retention {
              + days = 30
              + mode = "GOVERNANCE"
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

Execution:
```tf
scaleway_object_bucket.backup: Modifying... [id=fr-par/XXXXXXXX-debug-20220102-backup-appdata]
scaleway_object_bucket.backup: Modifications complete after 2s [id=fr-par/XXXXXXXX-debug-20220102-backup-appdata]
scaleway_object_bucket_lock_configuration.backup: Creating...
scaleway_object_bucket_lock_configuration.backup: Creation complete after 0s [id=fr-par/XXXXXXXX-debug-20220102-backup-appdata]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

```